----------------------------------------------------------------------------------------------Capture-6/Part-2----------------------------------------------------------------------------------------------------------

--Вычисляемые столбцы.

--Example-1
-Увеличить плановые продажи на 3% от фактических для каждого служаща=е=его.
SELECT name, quota, (quota + (.03 * sales)) 
    FROM salesreps;


--Example-2
--Повышение удобочитаемости при выводе данных с помощью использования констант.
SELECT city, 'has sales of', sales
    FROM offices;

